# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on One-to-Many and Many-to-many relationships!

## Objectives

You will be able to:
- Query data including Many-to-Many relationships
- Write queries that make use of Join Tables

## One-to-Many and Many-to-Many Joins
<img src='Database-Schema.png' width=550>

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [2]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

In [3]:
#Your code here
cur.execute('select firstName, lastName, city, state from offices join employees using(officeCode);')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print('Number of results:', len(df))
df.head()

Number of results: 23

  firstName   lastName           city state
0   Anthony        Bow  San Francisco    CA
1      Jeff   Firrelli  San Francisco    CA
2    Leslie   Jennings  San Francisco    CA
3     Diane     Murphy  San Francisco    CA
4      Mary  Patterson  San Francisco    CA

## Customers and their Orders (a One-to-Many join)

Return a list of all of the customers. For each customer return a record for each of their order numbers, order dates and statuses.

In [8]:
# Your code here
cur.execute("""select customerNumber, orderNumber, orderDate, status from customers
                      join orders
                      using(customerNumber);""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

  customerNumber orderNumber   orderDate   status
0            103       10123  2003-05-20  Shipped
1            103       10298  2004-09-27  Shipped
2            103       10345  2004-11-25  Shipped
3            112       10124  2003-05-21  Shipped
4            112       10278  2004-08-06  Shipped

## Orders and their Order Details (another One-to-Many join)

Return a list of orders. For each order return a record for each order detail within the order.

In [9]:
# Your code here
cur.execute("""select orderNumber, productCode, quantityOrdered, priceEach, orderLineNumber from orders
                      join orderdetails
                      using(orderNumber);""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

  orderNumber productCode quantityOrdered priceEach orderLineNumber
0       10100    S18_1749              30    136.00               3
1       10100    S18_2248              50     55.09               2
2       10100    S18_4409              22     75.46               4
3       10100    S24_3969              49     35.29               1
4       10101    S18_2325              25    108.06               4

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of the orders with the the order information, and all the product information for each product in the order.

In [12]:
# Your code here
cur.execute("""select * from orders
                        join orderdetails
                        using(orderNumber)
                        join products
                        using(productCode);""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]

## Summary

In this lab, you practiced your knowledge on One-to-Many and Many-to-many relationships!